OpenFOAM/foam9tutorials/tutorials/incompressible/simpleFoam/T3A/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    above
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    plate
    {
        type            calculated;
        value           nonuniform List<vector> 
340
(
(-5.11484 0.0251033 0)
(-5.1109 0.0751555 -4.12485e-21)
(-5.10305 0.124744 4.11212e-21)
(-5.09133 0.173563 1.22792e-20)
(-5.07581 0.221313 -8.13534e-21)
(-5.0566 0.267698 1.29506e-21)
(-5.03381 0.312433 -1.28291e-21)
(-5.00757 0.355241 -2.53755e-21)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
